<?php
$title = 'GeekBrains PHP basics. lesson 3';
$header = 'Задача ';
$taskNum = 1;
echo "
<!DOCTYPE html>
<html lang=\"ru\">
<head>
    <meta charset=\"UTF-8\">
    <title>{$title}</title>
</head>
<body>";

// Задача 1
echo "<h2>{$header}" . $taskNum++ . "</h2>";
$i = -1;
$divider = 3;
while (++$i <= 100) {
  $number = ($i % $divider) ? 0 : $i;
  if ($number) {
    echo $number . (($i + $divider) > 100 ? '.<br>' : ', ');
  };
};

// Задача 2
echo "<h2>{$header}" . $taskNum++ . "</h2>";
$i = -1;
while (++$i <= 10) {
  echo "{$i} – ";
  if ($i) {
    echo (($i % 2) ? 'не' : '') . 'четное число.<br>';
  } else {
    echo 'ноль.<br>';
  };
};

// Задача 3
echo "<h2>{$header}" . $taskNum++ . "</h2>";
// Двумерный массив: ассоциативный, каждый элемент - обычный массив.
$regions =
    ['Московская область' =>
      ['Апрелевка', 'Балашиха', 'Бронницы', 'Волоколамск', 'Воскресенск',
       'Голицыно', 'Дмитров', 'Долгопрудный', 'Егорьевск', 'Железнодорожный',
       'Жуковский', 'Зарайск', 'Звенигород', 'Ивантеевка', 'Истра', 'Кашира',
		   'Клин', 'Красногорск', 'Краснозаводск', 'Лобня', 'Люберцы', 'Можайск',
		   'Мытищи', 'Наро-Фоминск', 'Ногинск', 'Одинцово', 'Озеры',
		   'Павловский Посад', 'Пушкино', 'Раменское', 'Руза', 'Серпухов',
		   'Ступино', 'Талдом', 'Фрязино', 'Химки', 'Хотьково', 'Черноголовка',
		   'Чехов', 'Шатура', 'Щелково', 'Электрогорск', 'Электросталь',
		   'Юбилейный', 'Яхрома'],
     'Ленинградская область' =>
      ['Бокситогорск', 'Волхов', 'Выборг', 'Гатчина', 'Ивангород', 'Кингисепп',
       'Кириши', 'Кировск', 'Луга', 'Любань', 'Никольское', 'Новая Ладога',
		   'Отрадное', 'Пикалево', 'Подпорожье', 'Светогорск', 'Сертолово',
		   'Сясьстрой', 'Тихвин', 'Тосно', 'Шлиссельбург'],
       'Новосибирская область' =>
      ['Барабинск', 'Бердск', 'Болотное', 'Искитим', 'Карасук', 'Каргат',
       'Куйбышев', 'Купино', 'Новосибирск', 'Обь', 'Татарск', 'Тогучин',
		   'Черепаново', 'Чулым'],
     'Мурманская область' =>
      ['Апатиты', 'Гаджиево', 'Заозерск', 'Заполярный', 'Кандалакша',
       'Кировск', 'Ковдор', 'Кола', 'Мончегорск', 'Мурманск', 'Оленегорск',
		   'Островной', 'Полярные Зори', 'Полярный', 'Североморск', 'Снежногорск'],
       'Тыва республика' => ['Ак-Довурак', 'Кызыл', 'Туран', 'Чадан', 'Шагонар'],
     'Удмуртская Республика' =>
      ['Воткинск', 'Глазов', 'Ижевск', 'Камбарка', 'Можга', 'Сарапул']];
// Вывод массива
foreach ($regions as $key => $value) {
  echo "<p><b>{$key}:</b><br>";
  for ($i = 0; $i < count($regions[$key]); $i++) {
    echo "{$regions[$key][$i]}" . (($i + 1) < count($regions[$key]) ? ', ' : '.</p>');
  };
};

// Задача 4
echo "<h2>{$header}" . $taskNum++ . "</h2>";
  // Таблица транлитерации из приказа МИД № 4271 (загранпаспорт)
  $transLiters =
    array("А" => "A", "а" => "a",
          "Б" => "B", "б" => "b",
          "В" => "V", "в" => "v",
          "Г" => "G", "г" => "g",
          "Д" => "D", "д" => "d",
          "Е" => "E", "е" => "e",
          "Ё" => "E", "ё" => "e",
          "Ж" => "Zh", "ж" => "zh",
          "З" => "Z", "з" => "z",
          "И" => "I", "и" => "i",
          "Й" => "I", "й" => "i",
          "К" => "K", "к" => "k",
          "Л" => "L", "л" => "l",
          "М" => "M", "м" => "m",
          "Н" => "N", "н" => "n",
          "О" => "O", "о" => "o",
          "П" => "P", "п" => "p",
          "Р" => "R", "р" => "r",
          "С" => "S", "с" => "s",
          "Т" => "T", "т" => "t",
          "У" => "U", "у" => "u",
          "Ф" => "F", "ф" => "f",
          "Х" => "Kh", "х" => "kh",
          "Ц" => "Ts", "ц" => "ts",
          "Ч" => "Ch", "ч" => "ch",
          "Ш" => "Sh", "ш" => "sh",
          "Щ" => "Shch", "щ" => "shch",
          "Ъ" => "Ie", "ъ" => "ie",
          "Ы" => "Y'", "ы" => "y",
          "Ь" => "'", "ь" => "'",
          "Э" => "E'", "э" => "e",
          "Ю" => "Iu", "ю" => "iu",
          "Я" => "Ia", "я" => "ia");

function translitRuEn($inStr, $transTable) {
  $outStr = '';
  for ($i = 0; $i < strlen($inStr); $i++) {
    $st = mb_substr($inStr, $i, 1);
    $outStr .= array_key_exists($st, $transTable) ? $transTable[$st] : $st;
  };
  return $outStr;
};
echo '<p> Написать функцию транслитерации строк. <br>';
echo translitRuEn('Написать функцию транслитерации строк.', $transLiters) . '</p>';

// Задача 5
echo "<h2>{$header}" . $taskNum++ . "</h2>";
function spaceToUnderscore($inStr) {
  $outStr = '';
  for ($i = 0; $i < strlen($inStr); $i++) {
    $tempStr = mb_substr($inStr, $i, 1);
    $outStr .= ( $tempStr === ' ') ? '_' : $tempStr;
  };
  return $outStr;
};
echo '<p>Написать функцию, которая заменяет в строке пробелы на подчеркивания.<br>';
echo spaceToUnderscore('Написать функцию, которая заменяет в строке пробелы на подчеркивания.') . '</p>';

// Задача 6
echo "<h2>{$header}" . $taskNum++ . "</h2>";
echo 'Для вывода списка используем массив городов.';
echo '<ol>';
foreach ($regions as $key => $value) {
  echo "<li>{$key}";
  echo '<ul>';
  foreach ($regions[$key] as $subCity) {
    echo "<li>$subCity</li>";
  }
  echo '</ul>';
  echo '</li>';
}
echo '</ol>';
  
// Задача 7
echo "<h2>{$header}" . $taskNum++ . "</h2>";
$qty = 10;
for ($i = 0; $i <= $qty; print ($i++ . (($i <= $qty) ? ', ' : '.'))) { };

// Задача 8
echo "<h2>{$header}" . $taskNum++ . "</h2>";
// Вывод из массива городов, удовлетворяющих $regExp
foreach ($regions as $key => $value) {
  $isFirstCity = true;
  echo "<p><b>{$key}:</b><br>";
  for ($i = 0; $i < count($regions[$key]); $i++) {
    if (mb_substr($regions[$key][$i], 0, 1) == 'К') {
      if ($isFirstCity) {
        $isFirstCity = false;
      } else {
        echo ', ';
      }
      echo $regions[$key][$i];
    }
  }
  echo '<br>';
}

// Задача 9
echo "<h2>{$header}" . $taskNum++ . "</h2>";
function buildURL($inStr, $transTable) {
  $outStr = '';
  for ($i = 0; $i < strlen($inStr); $i++) {
    $st = mb_substr($inStr, $i, 1);
    if ($st === ' ') {
      $outStr .=  '_';
    } else {
      $outStr .= array_key_exists($st, $transTable) ? $transTable[$st] : $st;
    }
  };
  return $outStr;
};
echo '<p>Объединить две ранее написанные функции в одну<br>';
echo buildURL('Объединить две ранее написанные функции в одну', $transLiters) . '</p>';

echo "</body>
</html>";
?>